import React from 'react';
import {ReactComponent as ArrowSvg} from '../../../img/arrow.svg';
import { Link } from 'react-router-dom';
import { ROUTES } from '../../../utils/routes';

const PrivacyPolicy  = () => {
    return (
        <div className='policy'>
            <div className="policy__container">
                <div className="navigate">
                    <Link className='navigate__link' to={ROUTES.HOME}>головна</Link>
                    <ArrowSvg/>
                    <div className='navigate__link navigate__link-this'>Полiтика конфiденцiйностi</div>
                </div>
                <h2 className="policy__title">ПОЛIТИКА КОНФIДЕНЦIЙНОСТI</h2>
                <p className="policy__txt">
                    1. Головна інформація. <br /> 
                    Політика конфіденційності, що наведена нижче, - це документ службового користування для публічного ознайомлення. Керівництво інтернет ресурсу вирішує питання про спосіб захисту та обробки даних про юридичні, фізичні індивідууми, що користуються формою зворотного зв'язку.
                     <br /> Метою цього документа є – повною мірою забезпечити захист користувача, його персональні дані від розголошення та доступу сторонніх осіб. 
                    <br /> Двозв'язні відносини, що визначають порядок захисту, зберігання, розповсюдження, збору інформації про відвідувачів, регулюються цим документом та законом України. 
                    <br /> Цей документ є публічним, розроблений керівництвом ресурсу та повністю доступний усім користувачам під час переходу за посиланням «Політика конфіденційності» на сайті. 
                    <br/> Керівництво ресурсу має необмежені права на внесення змін до цього документа.
                    <br/> Після внесення змін до цього тексту, адмін сайту повідомляє абонентів про це, розміщуючи оновлену редакцію на сторінці «Політика конфіденційності».
                    <br/> Користувач висловлює свою згоду нові умови через форму зворотний зв'язок. Керівництво ресурсу не перевіряє достовірність зібраної інформації про клієнтів сайту. 
                    <br/>2. Умови, ціль збору, обробка персональних даних абонентів
                    <br/> Особисті дані кожного користувача, до яких входить: П.І.Б., номер телефону, e-mail та інші дані передаються користувачем адміністратору сайту за його безпосередньою згодою.
                    <br/> Обробка особистих даних абонента проводиться таким способом: 
                    <br/>- З дотриманням законності, методів обробки.
                    <br/> - Відповідно до цілей обробки інформації про клієнта.
                    <br/> - З недопущенням створення, об'єднання несумісних між собою баз даних із персональними даними. <br/>Керівництво ресурсу обробляє особисті дані клієнта лише маючи його згоду при наданні продажів, послуг, що пропонуються в інтернет магазині. 
                    <br/>3. Зберігання та застосування особистих даних
                    <br/> Вся персональна інформація на користувача зберігається тільки на електронних носіях і застосовується тільки строго за призначенням.
                    <br/> 4. Передача особистих даних
                    <br/> 4.1. Дані абонента, що є в адміністрації сайту, не підлягають передачі стороннім особам.
                    <br/> 4.2. Надання інформації про користувача, на запит державних структур, органів місцевого самоврядування здійснюється у порядку, передбаченому законами України.
                    <br/> 5. Час збереження та знищення особистих даних користувачів
                    <br/> 5.1. Персональні дані користувачів зберігаються на електронних носіях без давності.
                    <br/> 5.2. Особисті дані абонента можуть бути знищені, якщо він звернувся з таким бажанням до керівництва ресурсу, або з ініціативи адміністратора без пояснення причин у спосіб повного видалення інформації про користувача.
                    <br/> 6. Права та обов'язки абонентів
                    <br/> 6.1. Абоненти, які користуються послугами сайту, мають право отримувати від адміністрації інформацію в повному обсязі про обробку своїх даних.
                    <br/> 7. Методи захисту інформаційних даних користувача 
                    <br/>Керівництво ресурсу приймає на власний розсуд всі засоби для забезпечення захисту даних клієнта від незаконного або випадкового доступу до особистих даних від усіх неправомірних дій.
                    <br/> 8. Звернення від клієнтів
                    <br/> 8.1. Абоненти мають повне право отримувати від адміністрації інформацію щодо використання своїх особистих даних у письмовій формі.
                    <br/> 8.2. Запити надіслані адміністрації клієнтом оформляються у такий спосіб:
                    <br/> - Надсилається скан паспорта користувача.
                    <br/> - Число реєстрації запиту у формі зворотного зв'язку.
                    <br/> - Підпис клієнта. 8.3.
                    <br/> Керівництво ресурсу має розглянути та відповісти користувачеві протягом календарного місяця на запит.
                    <br/> Вся пошта, отримана адміністрацією від клієнта – це обмежена інформація та не використовується без згоди абонента, крім випадків, передбачених законом України.
                </p>
            </div>            
        </div>
    );
};

export default PrivacyPolicy;