import React from 'react';
import {ReactComponent as ArrowSvg} from '../../../img/arrow.svg';
import { ROUTES } from '../../../utils/routes';
import { Link } from 'react-router-dom';

const PublicOffer = () => {
    return (
        <div className='policy'>
            <div className="policy__container">
                <div className="navigate">
                    <Link className='navigate__link' to={ROUTES.HOME}>головна</Link>
                    <ArrowSvg/>
                    <div className='navigate__link navigate__link-this'>ПУБЛIЧНА ОФЕРТА</div>
                </div>
                <h2 className="policy__title">ПУБЛIЧНА ОФЕРТА</h2>
                <p className="policy__txt">
                    1. Загальні положення 
                    <br />1.1. Наступна публічна оферта (далі - "Оферта") є офіційним пропозиційним документом і містить умови купівлі продуктів кави на сайті bedoin.com.ua .
                    <br />1.2. Оферта є публічною, що означає, що її умови є однаковими для всіх покупців, які здійснюють покупку на сайті bedoin.com.ua
                    <br />1.3. При здійсненні покупки продуктів кави на сайті bedoin.com.ua, ви погоджуєтесь з усіма умовами, наведеними в цій Оферті.
                    <br />
                    <br />2. Товари та ціни
                    <br />2.1. Сайт bedoin.com.ua пропонує різноманітні види кави для продажу.
                    <br />2.2. Ціни на каву вказані на сайті bedoin.com.ua і можуть змінюватися в залежності від ринкової ситуації та доступності товару.
                    <br />2.3. Вартість кави вказується в національній валюті (або іншій валюті, залежно від контексту), і до ціни можуть додаватися додаткові збори, такі як податки або вартість доставки. Ці додаткові витрати будуть вказані окремо при оформленні замовлення.
                    <br />3. Оформлення замовлення
                    <br />3.1. Для здійснення покупки кави на сайті bedoin.com.ua вам необхідно додати вибраний товар до кошика, перейти до оформлення замовлення та вказати необхідні дані для доставки.
                    <br />3.2. При оформленні замовлення ви погоджуєтесь надати достовірну і повну ін
                    формацію про себе, включаючи контактні дані та адресу доставки.
                    <br />3.3. Після оформлення замовлення ви отримаєте підтвердження від нашого менеджера зазначеним при оформлені каналом зв’язку(e-mail, месенджер, тощо)
                    <br />4. Оплата
                    <br />4.1. Оплата замовлення кави на сайті bedoin.com.ua здійснюється заздалегідь з використанням доступних платіжних методів, які надаються на сайті.
                    <br />4.2. Після отримання оплати ми розпочнемо обробку вашого замовлення та здійснимо доставку зазначеним Вами способом.
                    <br />
                    <br />5. Доставка
                    <br />5.1. Ми здійснюємо доставку кави в зазначені регіони та країни, які вказані на сайті bedoin.com.ua
                    <br />5.2. Вартість доставки розраховується окремо від вартості кави і може залежати від вибраного способу доставки та місця призначення.
                    <br />5.3. Ми прагнемо забезпечити якнайшвидшу доставку замовлення, але терміни доставки можуть залежати від регіону та внутрішніх логістичних обставин.
                    <br />
                    <br />6. Повернення та обмін
                    <br />6.1. Згідно з чинним законодавством, покупці мають право на повернення або обмін продукту кави у випадку, якщо товар має брак або не відповідає заявленим характеристикам.
                    <br />6.2. Для повернення або обміну продукту кави вам необхідно звернутися до нас протягом тижня, починаючи з дати отримання замовлення. Докладніше про процедуру повернення ви зможете знайти на сайті bedoin.com.ua
                    <br />
                    <br />7. Конфіденційність
                    <br />7.1. Ми поважаємо вашу конфіденційність та зобов'язуємося
                    не розголошувати ваші персональні дані третім особам без вашої згоди, крім випадків, передбачених законодавством.
                    <br />7.2. Ми використовуємо ваші персональні дані тільки для обробки замовлення та зв'язку з вами щодо вашого замовлення.
                    <br />8. Заключні положення
                    <br />
                    <br />8.1. Ця Оферта є юридичною угодою між вами (покупцем) та bedoin.com.ua
                    <br />8.2. Ця Оферта підлягає та тлумачиться згідно з чинним законодавством України.
                    <br />8.3. Якщо будь-яка з положень цієї Оферти визнається недійсною або невиконуваною з будь-якої причини, це не вплине на дійсність або виконуваність інших положень.
                    <br />8.4. Будь-які спори або розбіжності, що виникнуть з цієї Оферти, будуть вирішуватися шляхом переговорів між сторонами. У разі недосягнення згоди, спори можуть бути передані на розгляд компетентного суду згідно з чинним законодавством.
                    <br />Дякуємо, що обрали bedoin.com.ua для покупки кави. Ми надаємо вам високоякісні продукти та професійний сервіс. Бажаємо вам приємного використання кави!
                </p>
            </div>            
        </div>
    );
};

export default PublicOffer;