import i18n from "i18next";
import { initReactI18next } from "react-i18next";

const resources = {
    uk: {
        translation: {
            // Home Page____________________________________________________________________________
            HomePageTxt: "Виробництво і продаж якісної кави в Україні",
            HomePageBtn: "Перейти в магазин",
            CofeeListSubTitle: "Обери свою ",
            CofeeListTitle: "КАВУ",
            DripListSubTitle: "Зручне пакування кави для дому та подорожей",
            DripListTitle: "ДРIП",
            OptSubTitle:
                "При замовленні від 6 кілограм кави - діє оптовий прайс на каву, безкоштовна доставка",
            OptTitle: "КОМБIНУЙ СМАКИ ТА ОТРИМУЙ ЗНИЖКУ",
            InformationHomePage: `
                 Ласкаво просимо до світу якісної кави, де кожне зерно має
                    свою унікальну історію. Замовляй свіжообсмажену каву, яка
                    зроблена спеціально для тебе
 
 
                    Пропонуємо вибір Specialty і Premium кави для бізнесу


                    Оптова Ціна від 6 кг


                    Bedoin розуміє потреби вашого бізнесу, тому ми пропонуємо
                    оптові ціни та безкошовну доставку для замовлень від 6 кг
                    кави.


                    Ми переймаємося вашим комфортом. Тому ми пропонуємо
                    безкоштовну доставку по Дніпру та послуги Нової Пошти для
                    замовлень з усієї України. Твоя улюблена кава Bedoin завжди
                    поруч – швидко та легко.


            `,
            HomeMerchTitle: "МЕРЧ ТА АКСЕСУАРИ",
            HomeMerchText: `Будь “BE DO IN” разом з нами! Все, від крутих
                            термочашок до стильних шоперів.`,
            ContactTxt:
                "Рекомендації, секрети і фішки по приготуванню смачної кави. Підписуйся!",

            FooterTxt:
                "Створення культури споживання натуральної кави для тих, хто шукає нові відчуття",
            // Coffe Page____________________________________________________________________________
            CoffeText:
                "При замовленні від 6 кілограм кави - діє оптовий прайс на каву, безкоштовна доставка",
            CoffeTitle: "КОМБIНУЙ СМАКИ ТА ОТРИМУЙ ЗНИЖКУ",
            CoffeSubTitle: `
                    Унікальні Пропозиції від Bedoin для Вашого Бізнесу
                    
                    
                    Bedoin пропонує умови для співпраці: Оптові ціни від 6 кг та
                    Індивідуальний Підхід: Кожен Партнер - Особливий
                    
                   
                    Ми розуміємо, що кожен бізнес має свої особливості та
                    смакові уподобання. Bedoin надає індивідуальний підхід для
                    кожного партнера, незалежно від того, чи це кав'ярня,
                    готель, ресторан чи офіс. Ми працюємо, щоб кожна чашка кави
                    відповідала вашим унікальним очікуванням.
                    
                    
                    Наша кава - це не просто напій, це досвід, який ми
                    пропонуємо вашим клієнтам. Кожне зерно обсмажене з любов'ю
                    та майстерністю, щоб Ваш бізнес завжди мав конкурентну
                    перевагу.
                    
                    `,
            // Drip Page____________________________________________________________________________

            DripSubTitle: `
                    DRIP COFFEE від Bedoin – це спешелті кава у зручному
                    пакуванні
                    
                    
                    Наша кава у Drip-пакуванні – це ідеальний варіант для тих,
                    хто цінує зручність та бажає отримувати якісний фільтр в
                    будь-якому місці.
                    
                    
                    Ці маленькі кавові друзі стануть Вашим незамінним супутником
                    під час походів, відряджень та мандрівок або просто у офісі,
                    коли дуже потрібна фільтр-кава. Bedoin пропонує оптові ціни
                    на нашу дріп-каву для бізнес-партнерів.
                    
                    
            `,
            // Drink Page____________________________________________________________________________
            DrinkSubTitle: `
                    Бажаєте здивувати своїх клієнтів і подарувати їм неабиякі
                    враження? Наші кавові напої Teddy – це саме те, що вам
                    потрібно
                    
                    
                    Засновані на колд-брю каві, наші напої TEDDY - це унікальне
                    поєднання кавових вражень та фруктових смаків,
                    
                    
                    ## TEDDY BERRIEBON – Це газований напій на основі колд-брю
                    кави з додаванням малинового соку та ферментованого ананасу.
                    
                    
                    ## TEDDY ALEANDFANT – Апельсиновий, кавовий напій, трохи
                    газований, смакує охолодженим. Примітно, що на кожну пляшку
                    витрачено 12гр кави – тобто повноцінна порція енергії.
                    
                    
                    Ми пропонуємо оптові ціни на нашу спеціальну лінійку кавових
                    напоїв Teddy для бізнес-партнерів
                    
                    
            `,

            // Contact Page____________________________________________________________________________
            ContactTitle: `КОНТАКТИ`,
            ContactPhoneTxt: "",
            ContactAdressTxt: "",

            // Merch Page____________________________________________________________________________

            // Cart Page____________________________________________________________________________

            OrderPickUp1:
                "Самовивіз (м. Дніпро, вул. Грушевського 50. З понеділка по п’ятницю з 9:00 до 17:00)",
            OrderPickUp2: "Доставка кур'єром(Тільки по Дніпру)",
            OrderPickUp3: "Нова Пошта",

            OrderPaymentCash: `Готівка при отриманні`,
            OrderPaymentScorePay: "Оплата на розрахунковий рахунок",
            OrderPaymentLiqPay: "Онлайн оплата(LiqPay)",
            OrderPaymentMonoPay:
                "plata by mono (оплата карткою, ApplePay, GooglePay)",

            OrderCallBack: "Зателефонувати після замовлення",
            OrderNotCallBack: " Можете мені не дзвонити",
            OrderTotalTxt: "",

            OrderPromoTitle: "Промокод:",
            OrderPromoNotice: "(Не діє при оптовій закупівлі)",
            // School Page____________________________________________________________________________

            SchoolMainTxt: `Навчання кавових 
            професіоналів у Дніпрі`,
            SchoolBtn: "Детальніше про курс",
            SchoolSliderTitle: "Кому це корисно?",
            SchoolSliderText1: "Початківцям і професійним бариста",
            SchoolSliderText2: "Власникам кавового бізнесу",
            SchoolSliderText3: "Адміністраторам та керуючим Horeca",
            SchoolSliderText4: "Любителям кави",
            SchoolSliderText5: "Тим, хто мріє відкрити власну кав'ярню",
            SchoolCoachTitle: "Тренера центра",
            SchoolCoachMaxLi1:
                "Обсмажчик кави, засновник школи і компанії Bedoin Coffee",
            SchoolCoachMaxLi2:
                "Працює у ресторанній сфері вже понад 10+ років, учасник та фіналіст кавових чемпіонатів",
            SchoolCoachMaxLi3:
                "Наша мета передати знання та досвід усім охочим, тим людям, які вирішили стати на шлях кави і не володіють часом, щоб пройти наш шлях",
            SchoolCoachDimLi1: " Працює у кавовій індустрії понад 5 років",
            SchoolCoachDimLi2: "Шеф бариста",
            SchoolCoachDimLi3:
                "Завдяки педагогічній освіті він легко знаходить спільну мову з кожним і зрозуміло пояснює складні речі",
            SchoolCoachDimLi4:
                "Діма любить заглиблюватися у всі тонкощі заварювання і вважає, що будь-яке зерно по-своєму смачне",

            SchoolCourseText1:
                "Дізнайтеся основи кавової справи: теорія кави, її походження, смак і аромати. Ідеально підходить для початківців.",
            SchoolCourseText2:
                "Опануйте основи кавового мистецтва та навчіться створювати ефектні малюнки на каві за допомогою латте-арту.",
            SchoolCourseText3:
                "Поглиблене навчання всіх аспектів кавової справи: робота за баром, альтернативні методи, калібрування смаку та використання професійного обладнання.",
            SchoolCourseText4:
                "Практичний курс для майбутніх власників кав’ярень: організація робочого процесу, налаштування обладнання та секрети успішного бізнесу.",
            SchoolCourseText5:
                "Дізнайтеся все про обсмажування кави, включаючи дефекти, калібрування смаку та створення ідеального продукту.",

            SchoolCoachNumber1: "років досвіду в кавовому бізнесі",
            SchoolCoachNumber2: "навчили бариста",
            SchoolCoachNumber3: "відкритих кав’ярень",

            SchoolFormTitle: "Хочеш приєднатись?",
            SchoolFormTxt: "Залишай свої дані, ми тобі перетелефонуємо",
            SchoolFormInfo: "Додаткова інформація",

            //___________________________________________________________________________________
        },
    },
    mat: {
        translation: {
            // Home Page____________________________________________________________________________
            HomePageTxt:
                "Обсмажуємо, варимо, продаємо, кайфуємо. Українська кава — без хєрні",
            HomePageBtn: "👉 ЙОЙ, В МАГАЗИН",
            CofeeListSubTitle:
                "Бо якщо не обереш — будеш пити якусь хрiнь з автомату.",
            CofeeListTitle: "ОБЕРИ СВОЮ... КАВУ, БЛІН ",
            DripListSubTitle:
                "Зручне, як чорт зна що — порвав пакетик, залив водичкою і кайфуй. Кава з собою? Та хоч до матері жінки неси — буде смачно.",
            DripListTitle: "ДРIП, ТВОЮ МАТIР!",
            OptSubTitle:
                "Більше кави — менше плати. 6 кіло — і вже ти оптовик, мать його.",
            OptTitle: "КОМБIНУЙ СМАКИ I НЕ СКУПИСЬ, КУРВО!",
            InformationHomePage: `

            
                МИ ЖЕ НЕ ЯКІСЬ бідолаги. КАВА — ТО НАША ФІШКА!

                В кожному зернятку — як не любов, то принаймні старання. Свіжообсмажена, аж парить, ідеальна, як твої фантазії після третьої чашки.

                ДЛЯ БІЗНЕСУ: КАВА КРЕЙЗІ!

                Преміум і спешелті, шоб твої клієнти присіли.

                ЦІНИ ЯК У ЛЮДЕЙ.
                
                Від 6 кг — опт.

                Доставка? Та канєшно, безкоштовна як пиздюлина.

                ПО ДНІПРУ ЛІТАЄМО, УКРАЇНОЮ — ПОШТОЮ!

                Швидко, бєз ПРИКОЛІВ. Хоч в село, хоч на офіс — Bedoin прилетить, як твоя дівка з претензіями
            
            `,
            HomeMerchTitle: "МЕРЧ — ШО КАЖЕШ?",
            HomeMerchText: `Такий шопер — хоч на Тиждень моди.            
            Термочашка — шоб не вилилось, коли несешся в маршрутці.`,
            ContactTxt: `БЛОГ: НЕ ЛИШЕ ТРИНДЕМО ПРО КАВУ
            Рецепти, фішки, лайфхаки — шоб ти був не просто бариста, а баристар.`,
            FooterTxt: `Bedoin — ЦЕ НЕ КАВА, ЦЕ НАСТРІЙ.
            Хочеш бути “BE DO IN”?
                То давай, не сци, замовляй.`,

            // Coffe Page____________________________________________________________________________

            CoffeText: `Замовляєш 6 кіло? Лови опт і доставку за наш рахунок.`,
            CoffeTitle: `Не розтягуй цю комедiю на сто дрiбних замовлень — бери порядошнонормально, щоб не мотати нам нерви`,
            CoffeSubTitle: `
                BEDOIN X БІЗНЕС: ТИ - НЕ ОДИН З БАГАТЬОХ, ТИ - Зі СВОЇМ ХАРАКТЕРОМ

                Твій бізнес — не для того, щоб “спробувати і забути”. Твій бізнес має “ух, бля!”. І ми знаємо, що треба, щоб ця “ух” звучала в кожній чашці.

                Працюємо з кавʼярнями, ресторанами, офісами — і ні з ким не граємось у стандартну хєрню. У тебе свої заморочки — у нас свої рішення. Як пазли, тільки смачні.

                КАВА НЕ ДЛЯ ТИХ, ХТО БОЇТЬСЯ СМАКУ

                Не пий ШМУРДЯК— пий Bedoin.

                Обсмажуємо зерна так, ніби це наш останній день на цій планеті. Бо якщо вже варити каву — то щоб при першому ковтку ти такий: “О, та ну нахєр, що це було?.. Ще давай!”
            `,

            // Drip Page____________________________________________________________________________

            DripSubTitle: `
            DRIP COFFEE від Bedoin — та сама кава, яку можна заварити навіть в лісі, в поїзді, або коли вже все остопиздило, тому харош в диван пердіти, го на вулицю!


            Це не просто пакетик з кавою. Це твій рятівник в офісі, розрада в дорозі, подруга в горах. Відкрив — залив — прибалдів. Без зайвого обладнання, без танців з бубном.
            Потрібно швидко та смачно? Drip врятує.


            А якщо ти не просто фанат кави, а ще й маєш бізнес — Bedoin дає оптові ціни на дріпи. Бо як не нам, то кому?


            `,
            // Drink Page____________________________________________________________________________
            DrinkSubTitle: `
                    Хочеш, щоб клієнт з першого ковтка сказав: "Блін, шо це за кайф?!" — значить TEDDY — мастхев.
                    
                    
                    Це не просто напій. Це кавовий оргазм з фруктовим бєквокалом. Cold brew, бульбашки, соки, і трохи магії — якби кава могла матюкнутись, вона б так і сказала: "та я шо, просто еспресо? я, ска, TEDDY!"*
                    

                    ## TEDDY BERRIEBON
                    Малина, ферментований ананас, газик і cold brew. Це не просто освіжає — це лупашить по рецепторах як треба. Такий мікс, що язик може сказати: «ну його в сраку ту СОСА СОЛУ».

                    
                    
                    ## TEDDY ALEANDFANT
                    Апельсинка з cold brew, злегка газована, енергії стільки, що після неї можна не тільки працювати — а ще й начальнику нахамити з посмішкою.
                    
                    
                    Опт є. Ціни для своїх. Якщо ти HoReCa, бар, шеф або просто в темі — пиши. Не тормози. Поки інші наливають воду з цукром — ти можеш продавати Teddy і стригти купони.
                    
            `,

            // Contacts Page____________________________________________________________________________
            ContactTitle: `
            Подзвонити — не соромно.
            Соромно — сидiти без нормальноi кави.
            `,
            ContactPhoneTxt: "-дзвони, тiльки не вночi, ми ж не психи.",
            ContactAdressTxt: "Ми тусимо тут:",
            // Merch Page____________________________________________________________________________
            // Order Page____________________________________________________________________________

            OrderPickUp1:
                "Сам прийдеш (м. Дніпро, вул. Грушевського 50. Пн-Пт, 9:00–17:00) Зайшов, забрав, попив каву, кайфонував.",
            OrderPickUp2:
                "Курʼєр по Дніпру Так, ми й самі можемо принести. Не баріться з адресою.",
            OrderPickUp3: `Нова Пошта 
                Шлемо по всій країні.
                Де ти — туди і полетить.`,

            OrderPaymentCash: `Готівка при отриманні
            Без театру — просто віддаєш грошики і щезаєш з кайфом.`,
            OrderPaymentScorePay: `На рахунок
 Для серйозних і бухгалтерських.`,
            OrderPaymentLiqPay: `LiqPay
 Хочеш – через мобілку, хочеш – з ноута. Головне — щоб заплатив.`,
            OrderPaymentMonoPay: `Plata by mono (картка, ApplePay, GooglePay)
 Одним тапом — і кава твоя.`,

            OrderCallBack: "Зателефонуйте, я скучив",
            OrderNotCallBack: "НЕ ДЗВОНИ МЕНІ, Я ВСЕ ЗНАЮ",
            OrderTotalTxt: "(Ой, як же ти попав на знижку, тигр)",
            OrderPromoTitle: "Промокод маеш?",
            OrderPromoNotice:
                "Пиши сюди (але знай: опт — святе, там знижки вже по максимуму)",

            // School Page____________________________________________________________________________
            SchoolMainTxt: `
                Навчаємо кавових профі у Дніпрі 
                і тих, хто хоче вміти бодай щось, 
                крім налити кипʼятка в 3в1.
             `,
            SchoolBtn: `Детальніше про курс - унизу
             не фільонься`,
            SchoolSliderTitle: "КОМУ ЦЕ НАФIГ ПОТРIБНО?",
            SchoolSliderText1:
                "Новеньким баристам і тим, хто вже пів життя за еспресо стоїть (Але досі не розрізняє, де Бразилія, а де Ефіопія)",
            SchoolSliderText2:
                "Власникам кавового бізнесу (Щоб нарешті зрозуміти, за що ти платиш обсмажчику)",
            SchoolSliderText3:
                "Адмінам і менеджерам закладів (Бо баристи іноді краще знають, що робити — треба наздоганяти)",
            SchoolSliderText4:
                "Любителям кави (Так, і для тебе, хто заливає Lavazza з Ашану в Chemex)",
            SchoolSliderText5:
                "Тим, хто хоче відкрити свою кавʼярню (Перед тим як влупити мільйон на ремонт — приходи сюди)",
            SchoolCoachTitle: "НАШІ ГОЛОВНІ КАВОВІ ГОЛОВАЧІ",
            SchoolCoachMaxLi1:
                "Засновник Bedoin Coffee, обсмажує каву, змагається, навчає.",
            SchoolCoachMaxLi2: "10+ років досвіду, знає все, що пахне кавою.",
            SchoolCoachMaxLi3:
                " Каже прямо: «Хочеш — навчу, не хочеш — гуляй».",
            SchoolCoachDimLi1: "Із ним нудно не буде — це точно.",
            SchoolCoachDimLi2: "Шеф бариста",
            SchoolCoachDimLi3:
                "Бариста з освітою вчителя, пояснить так, що навіть твій пес зварить V60.",
            SchoolCoachDimLi4:
                "Копає глибоко, шарить у всьому, кайфує від кожного зерна.",
            SchoolCourseText1: `Від зерна до портафільтра
            Все, що треба, щоб не облажатись на першому робочому дні`,
            SchoolCourseText2: `Малюємо сердечки, листочки й інші «оце вау»
            Люди платять за картинку — вчися малювати`,
            SchoolCourseText3: `Альтернатива, калібрування, рецептури, жонглювання джагами (ну майже)
            Тут уже не смішно — тут серйозно`,
            SchoolCourseText4:
                "Без булшиту: як зварити бізнес, а не розлити сльози",
            SchoolCourseText5: `Обсмажуй, нюхай, калібруй
            І стань тим, хто робить каву смачною до кісток`,

            SchoolCoachNumber1: "років у темі",
            SchoolCoachNumber2: "барист уже в полі",
            SchoolCoachNumber3: "кавʼярень відкрили наші випускники",

            SchoolFormTitle: "Хочеш?",
            SchoolFormTxt: "Та заповнюй форму і не випендрюйся",
            SchoolFormInfo: "якісь свої хотєлки — і ми перетелефонуємо",

            //___________________________________________________________________________________
        },
    },
};

i18n.use(initReactI18next) // passes i18n down to react-i18next
    .init({
        fallbackLng: "uk", // use en if detected lng is not available
        resources,
        lng: "uk",
        interpolation: {
            escapeValue: false, // react already safes from xss
        },
    });

export default i18n;
